In [1]:
%load_ext sql

In [2]:
# dialect+driver://username:password@host:port/database

In [3]:
%%sql sqlite:///foo1.db

CREATE TABLE writer (first_name, last_name, year_of_death);

Done.

[]

In [4]:
%%sql
INSERT INTO writer VALUES ('Shubham', 'Sharma', 2020);
INSERT INTO writer VALUES ('Naman', 'Garg', Null);
INSERT INTO writer VALUES ('William', 'Shakespearer', 1956);
INSERT INTO writer VALUES ('Bertold', 'Brecht', 1616);

 * sqlite:///foo1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql
select * from writer

 * sqlite:///foo1.db
Done.

[('Shubham', 'Sharma', 2020),
 ('Naman', 'Garg', None),
 ('William', 'Shakespearer', 1956),
 ('Bertold', 'Brecht', 1616)]

In [7]:
%%sql
select first_name, last_name from writer

 * sqlite:///foo1.db
Done.

[('Shubham', 'Sharma'),
 ('Naman', 'Garg'),
 ('William', 'Shakespearer'),
 ('Bertold', 'Brecht')]

In [10]:
%%sql

select * from writer where year_of_death > 2000

 * sqlite:///foo1.db
Done.

[('Shubham', 'Sharma', 2020)]

In [11]:
%%sql
select first_name, last_name as surname from writer

 * sqlite:///foo1.db
Done.

[('Shubham', 'Sharma'),
 ('Naman', 'Garg'),
 ('William', 'Shakespearer'),
 ('Bertold', 'Brecht')]

In [12]:
%%sql

select COUNT(first_name) from writer where year_of_death < 2000

 * sqlite:///foo1.db
Done.

[(2,)]

In [28]:
result = %sql select * from writer

 * sqlite:///foo1.db
Done.

In [29]:
type(result)

sql.run.ResultSet

In [30]:
type(result.DataFrame())

pandas.core.frame.DataFrame

In [31]:
dataframe = result.DataFrame()

In [32]:
dataframe

  first_name     last_name  year_of_death
0    Shubham        Sharma         2020.0
1      Naman          Garg            NaN
2    William  Shakespearer         1956.0
3    Bertold        Brecht         1616.0